Конфигурация отчетов/DataProcessors/НастройкаРасширений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>НастройкаРасширений</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Конфигурация отчетов/Catalogs/ОбработчикиСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ОбработчикиСобытий</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.События</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПодписчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработчик</Name>
					<Comment>Имя экспортной процедуры в формате "ИмяМодуля.ИмяПроцедуры"</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодОбработчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Конфигурация отчетов/DataProcessors/НастройкаРасширений/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура ЗарегистрироватьПодписчиков(Команда)        
	ЗарегистрироватьПодписчиковНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗарегистрироватьПодписчиковНаСервере()
    Попытка
        Запрос = Новый Запрос;
        Запрос.Текст = 
        "ВЫБРАТЬ
        |   ОбработчикиСобытий.Событие КАК Событие,
        |   ОбработчикиСобытий.ИдентификаторПодписчика КАК ИдентификаторПодписчика,
        |   ОбработчикиСобытий.Обработчик КАК Обработчик,
        |   ОбработчикиСобытий.КодОбработчика КАК КодОбработчика
        |ИЗ
        |   Справочник.ОбработчикиСобытий КАК ОбработчикиСобытий
        |ГДЕ
        |   НЕ ОбработчикиСобытий.ПометкаУдаления";
        
        Выборка = Запрос.Выполнить().Выбрать();
        
        Пока Выборка.Следующий() Цикл
            Если Выборка.Событие.Пустая() Тогда
                ЗаписьЖурналаРегистрации("EventBus.Ошибка", 
                    УровеньЖурналаРегистрации.Ошибка, , , 
                    "Пустое событие для подписчика: " + Выборка.ИдентификаторПодписчика);
                Продолжить;
            КонецЕсли;
            
            Если ПустаяСтрока(Выборка.КодОбработчика) Тогда
                ЗаписьЖурналаРегистрации("EventBus.Ошибка", 
                    УровеньЖурналаРегистрации.Ошибка, , , 
                    "Пустой код обработчика для подписчика: " + Выборка.ИдентификаторПодписчика);
                Продолжить;
            КонецЕсли;
            
            EventBus.ЗарегистрироватьПодписчика(
                Выборка.Событие, 
                Выборка.Обработчик, 
                Выборка.ИдентификаторПодписчика,
                Выборка.КодОбработчика);
        КонецЦикла;
        
        Сообщить("Регистрация подписчиков завершена");
        ЗаписьЖурналаРегистрации("EventBus.Диагностика", 
            УровеньЖурналаРегистрации.Информация, , , 
            "Регистрация подписчиков завершена в обработке НастройкаРасширений");
    Исключение
        Сообщить("Ошибка при регистрации подписчиков: " + ОписаниеОшибки());
        ЗаписьЖурналаРегистрации("EventBus.Ошибка", 
            УровеньЖурналаРегистрации.Ошибка, , , 
            "Ошибка при регистрации подписчиков: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры
